app/controllers/articles_controller.rb

  def update
    # raise params.inspect
    find_article
    @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-08-07 03:57:13.499630"], ["id", 1]]